In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'Class1':[95, 92, 98, 100], 'Class2':[91,93,97,99]})

In [4]:
df

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [5]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 74], 
                          'Height':[165, 177, 160, 180]}, 
                           index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])

In [6]:
df_WH

      Weight  Height
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [8]:
df_WH.index.name = 'User'

In [9]:
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [10]:
tips = pd.read_csv('./temp/tips.csv')

In [11]:
tips = tips.sample(10)

In [12]:
tips

     total_bill   tip smoker   day    time  size
138       16.00  2.00    Yes  Thur   Lunch     2
151       13.13  2.00     No   Sun  Dinner     2
172        7.25  5.15    Yes   Sun  Dinner     2
92         5.75  1.00    Yes   Fri  Dinner     2
35        24.06  3.60     No   Sat  Dinner     3
155       29.85  5.14     No   Sun  Dinner     5
195        7.56  1.44     No  Thur   Lunch     2
3         23.68  3.31     No   Sun  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2
240       27.18  2.00    Yes   Sat  Dinner     2

In [20]:
grouped = tips['total_bill'].groupby(tips['smoker'])
means = tips['total_bill'].groupby(tips['smoker']).mean()

In [21]:
print(means)

smoker
No     19.510
Yes    14.045
Name: total_bill, dtype: float64

In [15]:
randArray = np.random.randint(1, 10, len(tips))
rMeans = tips.groupby(randArray).mean()
print(rMeans)

   total_bill   tip  size
1      23.680  3.31   2.0
3      16.465  1.50   2.0
4      15.810  2.52   2.5
5      24.315  4.07   3.5
7      14.565  2.00   2.0
8       7.250  5.15   2.0

In [16]:
for day, smoker in grouped:
    print(day)
    print(smoker)

No
151    13.13
35     24.06
155    29.85
195     7.56
3      23.68
243    18.78
Name: total_bill, dtype: float64
Yes
138    16.00
172     7.25
92      5.75
240    27.18
Name: total_bill, dtype: float64

In [17]:
for (key1, key2), group in tips.groupby(['smoker', 'day']):
    print(key1, key2)
    print(group)

No Sat
    total_bill  tip smoker  day    time  size
35       24.06  3.6     No  Sat  Dinner     3
No Sun
     total_bill   tip smoker  day    time  size
151       13.13  2.00     No  Sun  Dinner     2
155       29.85  5.14     No  Sun  Dinner     5
3         23.68  3.31     No  Sun  Dinner     2
No Thur
     total_bill   tip smoker   day    time  size
195        7.56  1.44     No  Thur   Lunch     2
243       18.78  3.00     No  Thur  Dinner     2
Yes Fri
    total_bill  tip smoker  day    time  size
92        5.75  1.0    Yes  Fri  Dinner     2
Yes Sat
     total_bill  tip smoker  day    time  size
240       27.18  2.0    Yes  Sat  Dinner     2
Yes Sun
     total_bill   tip smoker  day    time  size
172        7.25  5.15    Yes  Sun  Dinner     2
Yes Thur
     total_bill  tip smoker   day   time  size
138        16.0  2.0    Yes  Thur  Lunch     2

In [22]:
eachgroup = dict(list(tips.groupby('day')))

In [23]:
print(eachgroup)

{'Fri':     total_bill  tip smoker  day    time  size
92        5.75  1.0    Yes  Fri  Dinner     2, 'Sat':      total_bill  tip smoker  day    time  size
35        24.06  3.6     No  Sat  Dinner     3
240       27.18  2.0    Yes  Sat  Dinner     2, 'Sun':      total_bill   tip smoker  day    time  size
151       13.13  2.00     No  Sun  Dinner     2
172        7.25  5.15    Yes  Sun  Dinner     2
155       29.85  5.14     No  Sun  Dinner     5
3         23.68  3.31     No  Sun  Dinner     2, 'Thur':      total_bill   tip smoker   day    time  size
138       16.00  2.00    Yes  Thur   Lunch     2
195        7.56  1.44     No  Thur   Lunch     2
243       18.78  3.00     No  Thur  Dinner     2}

In [24]:
print(eachgroup['Sat'])

     total_bill  tip smoker  day    time  size
35        24.06  3.6     No  Sat  Dinner     3
240       27.18  2.0    Yes  Sat  Dinner     2

In [25]:
tip_dframe = tips.groupby('day')['tip'].mean()
tip_dframe

day
Fri     1.000000
Sat     2.800000
Sun     3.900000
Thur    2.146667
Name: tip, dtype: float64

In [26]:
tip_dframe = tips.groupby('day')[['tip']].mean()
tip_dframe

           tip
day
Fri   1.000000
Sat   2.800000
Sun   3.900000
Thur  2.146667

In [29]:
df = pd.read_excel('./temp/학생시험성적.xlsx', sheet_name=u'2차시험', index_col=u'학생')
df

    과학  사회   역사         평균
학생
A   90  95   85  90.000000
B   85  90   80  85.000000
C   70  80   75  75.000000
D   75  90  100  88.333333
E   90  80   90  86.666667

In [34]:
excel_exam_data1 = {u'학생': ['A', 'B', 'C', 'D', 'E', 'F'], 
                        u'국어': [80, 90, 95, 70, 75, 85], 
                        u'영어': [90, 95, 70, 85, 90, 95], 
                        u'수학': [85, 95, 75, 80, 85, 100]} 

df1 = pd.DataFrame(excel_exam_data1, columns=[u'학생', u'국어', u'영어', u'수학'])
df1

  학생  국어  영어   수학
0  A  80  90   85
1  B  90  95   95
2  C  95  70   75
3  D  70  85   80
4  E  75  90   85
5  F  85  95  100

In [35]:
excel_exam_data2 = {u'학생': ['A', 'B', 'C', 'D', 'E', 'F'], 
                        u'국어': [85, 95, 75, 80, 85, 100], 
                        u'영어': [80, 90, 95, 70, 75, 85], 
                        u'수학': [90, 95, 70, 85, 90, 95]} 

df2 = pd.DataFrame(excel_exam_data2, columns=[u'학생', u'국어', u'영어', u'수학'])
df2

  학생   국어  영어  수학
0  A   85  80  90
1  B   95  90  95
2  C   75  95  70
3  D   80  70  85
4  E   85  75  90
5  F  100  85  95

In [39]:
excel_writer = pd.ExcelWriter(u'./temp/학생시험성적_수정.xlsx', engine='xlsxwriter')
df1.to_excel(excel_writer, index=False, sheet_name=u'중간고사')
df2.to_excel(excel_writer, index=False, sheet_name=u'기말고사')
excel_writer.save()

In [40]:
import glob

In [42]:
excel_data_files = [u'./temp/담당자별_판매량_Andy사원.xlsx', 
                       u'./temp/담당자별_판매량_Becky사원.xlsx', 
                       u'./temp/담당자별_판매량_Chris사원.xlsx'] 

total_data = pd.DataFrame()
for f in excel_data_files:
    df = pd.read_excel(f)
    total_data = total_data.append(df, ignore_index=True)

In [43]:
excel_writer = pd.ExcelWriter(u'./temp/담당자별_판매량_통합.xlsx',engine='xlsxwriter')
total_data.to_excel(excel_writer, index=False)
excel_writer.save()